/**
 * ====================================================================
 * 【核心数据保护声明】
 * 未经用户明确允许，禁止修改此文件中的任何常量配置、资产列表或个股原始财务数据。
 * 此文件包含系统的基础运行参数：折现率、目标资产配比以及个股近5年的核心财务指标。
 * ====================================================================
 */

import { StockConfig, Property } from './types';

export const ZHE_XIAN = 0.03;
export const ALL_DEBT = 244438 - 43.41 * 700
export const MI_RATIO = 0.20093138;
export const MA_RATIO = 0.16890258;

// 初始资金常量
export const MI_INITIAL = 697613;
export const MA_INITIAL = 400000;
// 妈妈今年初始资产 (用于收益率计算基准)
export const MA_YEAR_START_ASSET = 546776;

export const TAG_RATIO_MAP: Record<string, number> = {
  '黄金': 10,
  '石油': 5,
  '债券': 10,
  '有色': 5,
  '中港': 50,
  '美股': 10,
  '现金': 10
};

export const RAW_PROPERTIES: Property[] = [
  { code: 'HK00700', tag: '中港', num: 400, name: '腾讯', exchange: 'hk' },
  { tag: '现金', num: 6541, name: '人民币' },
  { code: 'USSPYM', tag: '美股', num: 484, exchange: 'us' },
  { tag: '现金', num: 3363 + 57125 - 50847, name: '港币', exchange: 'hk' },
  { tag: '现金', num: 3823 + 17.27 + 120.47 + 74.97 * 7.6144, name: '美元', exchange: 'us' },
  { code: 'SH511520', tag: '债券', name: '中债', num: 3100, danbao: true },
  { code: 'HK00883', tag: '石油', num: 7000, exchange: 'hk' },
  { code: 'SH600938', tag: '石油', num: 400, danbao: true },
  { code: 'SH518880', tag: '黄金', num: 21600, name: '黄金etf', danbao: true },
  { code: 'SH600809', tag: '中港', num: 0, name: '汾酒', danbao: true },
  { code: 'SH600519', tag: '中港', num: 900, name: '茅台', danbao: true },
  { tag: '黄金', num: 145, name: '国外黄金', code: 'USIAU', exchange: 'us' },
  { tag: '有色', num: 4700, code: 'SH601899', danbao: true },
  { tag: '中港', code: 'HK09992', num: 2400, name: '泡泡玛特', exchange: 'hk' },

  // 咪咪账户里
  { code: 'SH511520', tag: '债券', name: '中债', num: 400 },
  { code: 'SH600938', tag: '石油', num: 500 },
  { code: 'SH600036', tag: '中港', num: 6600, name: '招行' },
  { tag: '有色', num: 700, code: 'SH601899' },
  { tag: '现金', num: 108152 + 43.41 * 100, name: '人民币' },
  { code: 'SH518880', tag: '黄金', num: 4600, name: '黄金etf' },
];

// 沪深300增速，用来作为增速预估的基准
export const HUSHEN_G = 5.17

export const RAW_STOCKS: Record<string, StockConfig> = {
  招行: {
    code: 'SH600036',
    目标价格: 55.4,
    动态收益: 5.7,
    增速: [1.21, 2.81, 4.02],
    未来增速: 0.5 * HUSHEN_G,
    // ai预测4%-5%，比较合理，由于长期看净息差压力+房地产压力始终存在，因此适当调低
    分红率: 33.26,
    回购率: 0,
    股权折价: 1,
    额外价值: 2,
    次级: true
  },
  腾讯: {
    code: 'HK00700',
    目标价格: 772,
    动态收益: 30.41, // 要用non-ifrs口径(投资圈估值默认用这个）
    增速: [17.16, 13.76, 11.71],
    未来增速: 1.5 * HUSHEN_G,
    // ai预测6%-9%，比较合理。AI给腾讯这种游戏+广告+互联网大厂带来的降本增效效果会很显著
    // 分红率和回购率也得基于 Non-IFRS 口径，这样才一致
    分红率: 17.38,
    回购率: 39.36,
    股权折价: 0.79,
    额外价值: 0,
  },
  茅台: {
    code: 'SH600519',
    目标价格: 1901,
    动态收益: 72.41,
    增速: [5.15, 5.68, 6.69],
    // ai预测5%-8%，基于直营提升以及高溢价，增速略高于GDP合理
    未来增速: 1.5 * HUSHEN_G,
    分红率: 75,
    回购率: 2.58,
    股权折价: 1,
    额外价值: 2,
  },
  港交: {
    code: 'HK00388',
    目标价格: 519.67,
    动态收益: 13.61,
    增速: [32.26, 1.96, 7.71],
    // ai预测5%-8%，合理，经济的叉乘者
    未来增速: 1.5 * HUSHEN_G,
    分红率: 89.9,
    回购率: 0,
    股权折价: 0.79,
    额外价值: 0,
  },
  泡泡: {
    code: 'HK09992',
    目标价格: 364,
    动态收益: 10.21,
    增速: [283.56, 30.64, 23.86],
    // ip热度有周期，成熟期后视为跟随通胀
    未来增速: HUSHEN_G,
    分红率: 34.45,
    回购率: 33.7 / 2,
    股权折价: 0.79,
    额外价值: 0,
  },
  沪深: {
    code: 'SH510300',
    历史估值: 12.4,
    动态收益: ((4.919 / 14.6) * 4 * (1 + 0.0687)) / (3 * (1 + 0.0687) + 1),
    增速: [HUSHEN_G, HUSHEN_G, HUSHEN_G],
    未来增速: HUSHEN_G,
    分红率: 36.9,
    回购率: 2.3 / 2,
    股权折价: 1,
    额外价值: 2,
  },
  长电: {
    code: 'SH600900',
    目标价格: 32.62,
    动态收益: 1.3964,
    增速: [5.14, 4.62, 4.23],
    // ai预测4%-6%，合理，AI时代电价预期上涨
    未来增速: HUSHEN_G,
    分红率: 75.75,
    回购率: 0,
    股权折价: 1,
    额外价值: 2,
    次级: true
  },
  汾酒: {
    code: 'SH600809',
    目标价格: 212.8,
    动态收益: 9.99,
    增速: [-0.51, 5.29, 8.93],
    // ai预测6%-10%，光瓶酒竞争加剧，调低一档
    未来增速: HUSHEN_G,
    分红率: 54.5,
    回购率: 0,
    股权折价: 1,
    额外价值: 2,
    次级: true
  },
  顺丰: {
    code: 'SZ002352',
    动态收益: 2.175,
    目标价格: 55.22,
    增速: [7.85, 13.71, 13.81],
    // ai预测8%-9%，基于机场产能的优化、ai和机器人的优化可以对冲人工成本的上升。冷链及海外业务的拓展带来增量
    // 但考虑到京东快递的存在，以及快递行业经常价格战，顺丰的净利率不是那么稳固，因此调低一档
    未来增速: HUSHEN_G,
    分红率: 35,
    回购率: 14.4,
    股权折价: 1,
    额外价值: 3,
    次级: true
  },
  阿胶: {
    code: 'SZ000423',
    动态收益: 2.78,
    目标价格: 73.94,
    增速: [15.19, 15.95, 14.83],
    // 考虑到提价权和驴皮成本的上升，叠加老龄化趋势，综合给一个符合通胀的永续增长
    未来增速: HUSHEN_G,
    分红率: 100,
    回购率: 0,
    股权折价: 1,
    额外价值: 3,
    次级: true
  },
  SPYM: {
    code: 'USSPYM',
    onlyPrice: true,
    动态收益: 1
  },
  // 老窖: {
  //   code: 'SZ000568',
  //   动态收益: 8.86,
  //   目标价格: 164.28,
  //   增速: [-3.22, 1.99, 4.82],
  //   // ai预测5%-6%，合理
  //   未来增速: HUSHEN_G,
  //   分红率: 70,
  //   回购率: 0,
  //   股权折价: 1,
  //   额外价值: 3,
  // },
  // 福耀: {
  //   code: 'SH600660',
  //   折价: 0.7,
  //   现金: [52.8, 56.8, 58.9, 76.2, 85.6],
  //   roic表: [8.19, 9.4, 12, 12.2, 14.3],
  //   利润表: [26, 31.5, 47.6, 56.3, 75],
  //   动态收益: 3.72,
  //   增速: [29.4, 13.7, 15.2],
  //   分红率: 58.21,
  //   回购率: 0,
  //   股权折价: 1,
  //   额外价值: 2,
  //   周期: 0.75
  // },
  // 分众: {
  //   code: 'SZ002027',
  //   折价: 0.7,
  //   现金: [52.2, 95.9, 67, 76.8, 66.4],
  //   roic表: [24.2, 30.8, 13.2, 22.9, 24.3],
  //   利润表: [40, 60.6, 27.9, 48.3, 51.5],
  //   动态收益: 0.39,
  //   增速: [9.53, 10.7, 8.57],
  //   分红率: 86.79,
  //   回购率: 0,
  //   股权折价: 1,
  //   额外价值: 3,
  //   周期: 0.75
  // },
};