/**
 * ====================================================================
 * 【核心数据保护声明】
 * 未经用户明确允许，禁止修改此文件中的任何常量配置、资产列表或个股原始财务数据。
 * 此文件包含系统的基础运行参数：折现率、目标资产配比以及个股近5年的核心财务指标。
 * ====================================================================
 */

import { StockConfig, Property } from './types';

export const ZHE_XIAN = 0.04;
export const ALL_DEBT = 236627
export const MI_RATIO = 0.195873379;
export const MA_RATIO = 0.169267677;

// 初始资金常量
export const MI_INITIAL = 677964;
export const MA_INITIAL = 400000;
// 妈妈今年初始资产 (用于收益率计算基准)
export const MA_YEAR_START_ASSET = 546776;

export const TAG_RATIO_MAP: Record<string, number> = {
  '黄金': 10,
  '石油': 5,
  '债券': 10,
  '有色': 5,
  '中港': 50,
  '美股': 10,
  '现金': 10
};

export const RAW_PROPERTIES: Property[] = [
  { code: 'HK00700', tag: '中港', num: 400, name: '腾讯', exchange: 'hk' },
  { tag: '现金', num: 0, name: '人民币' },
  { code: 'USSPYM', tag: '美股', num: 484, exchange: 'us' },
  { tag: '现金', num: 3363 + 457927 - 421600, name: '港币', exchange: 'hk' },
  { tag: '现金', num: 3.14 + 36.07 + 69.23 * 7.6144, name: '美元', exchange: 'us' },
  { code: 'SH511520', tag: '债券', name: '中债', num: 3100, danbao: true },
  { code: 'HK00883', tag: '石油', num: 7000, exchange: 'hk' },
  { code: 'SH600938', tag: '石油', num: 300, danbao: true },
  { code: 'SH518880', tag: '黄金', num: 21600, name: '黄金etf', danbao: true },
  { code: 'SH600809', tag: '中港', num: 0, name: '汾酒', danbao: true },
  { code: 'SH600519', tag: '中港', num: 900, name: '茅台', danbao: true },
  { tag: '黄金', num: 145, name: '国外黄金', code: 'USIAU', exchange: 'us' },
  { tag: '有色', num: 5400, code: 'SH601899', danbao: true },
  { tag: '中港', code: 'HK09992', num: 2400, name: '泡泡玛特', exchange: 'hk' },

  // 咪咪账户里
  { code: 'SH511520', tag: '债券', name: '中债', num: 400 },
  { code: 'SH600938', tag: '石油', num: 500 },
  { code: 'SH600036', tag: '中港', num: 6600, name: '招行' },
  { tag: '有色', num: 800, code: 'SH601899' },
  { tag: '现金', num: 112421, name: '人民币' },
  { code: 'SH518880', tag: '黄金', num: 4600, name: '黄金etf' },
];

// 沪深300增速，用来作为增速预估的基准
export const HUSHEN_G = 5.17

export const RAW_STOCKS: Record<string, StockConfig> = {
  腾讯: {
    // 全部数据都更新至25年年报
    code: 'HK00700',
    目标价格: 747.69,
    动态收益: 31.02, // 要用non-ifrs口径(投资圈估值默认用这个）
    增速: 2 * HUSHEN_G,
    // 分红率和回购率也得基于 Non-IFRS 口径，这样才一致
    分红率: (24.71 + 18.44 + 19.84) / 3, // 20.99
    回购率: (28.47 + 45.73 + 28.27) / 3, // 34.15
    股权折价: 0.8,
    额外价值: 0
  },
  茅台: {
    code: 'SH600519',
    目标价格: 1882.29,
    动态收益: 21.38 + 14.8 + 15.35 + 18.607,
    增速: 2 * HUSHEN_G,
    分红率: 75,
    回购率: 1.86,
    股权折价: 1,
    额外价值: 2
  },
  港交: {
    // 全部数据都更新至25年年报
    code: 'HK00388',
    目标价格: 521.53,
    动态收益: 14.01,
    增速: 1.5 * HUSHEN_G,
    分红率: 90,
    回购率: 0,
    股权折价: 0.8,
    额外价值: 0
  },
  沪深: {
    code: 'SH510300',
    动态收益: ((4.919 / 14.6) * 4 * (1 + 0.0687)) / (3 * (1 + 0.0687) + 1),
    增速: HUSHEN_G,
    分红率: 39.99,
    回购率: 2.78,
    股权折价: 1,
    额外价值: 2
  },
  长电: {
    code: 'SH600900',
    目标价格: 33.86,
    动态收益: 1.3964,
    增速: 0.5 * HUSHEN_G,
    分红率: 71.8,
    回购率: 0,
    股权折价: 1,
    额外价值: 2
  },
  招行: {
    code: 'SH600036',
    目标价格: 53.12,
    动态收益: 5.7,
    增速: 0.5 * HUSHEN_G,
    分红率: 35.3,
    回购率: 0,
    股权折价: 1,
    额外价值: 2
  },
  泡泡: {
    code: 'HK09992',
    目标价格: 339.81,
    动态收益: 3.771 + 7.651,
    增速: 1.5 * HUSHEN_G,
    分红率: 35,
    回购率: 16.4,
    股权折价: 0.8,
    额外价值: 0
  },
  汾酒: {
    code: 'SH600809',
    目标价格: 229.34,
    动态收益: 5.45 + 1.52 + 2.38 + 0.515,
    增速: 0.5 * HUSHEN_G,
    分红率: 60.39,
    回购率: 0,
    股权折价: 1,
    额外价值: 2
  },
  顺丰: {
    code: 'SZ002352',
    动态收益: 0.45 + 0.71 + 0.51 + 0.525,
    目标价格: 52.53,
    增速: 1.5 * HUSHEN_G,
    分红率: 35,
    回购率: 9.88,
    股权折价: 1,
    额外价值: 3
  },
  老窖: {
    code: 'SZ000568',
    动态收益: 3.13 + 2.08 + 2.1 + 0.966,
    目标价格: 163.42,
    增速: 0,
    分红率: 72.5,
    回购率: 0,
    股权折价: 1,
    额外价值: 3
  }
};