/**
 * ====================================================================
 * 【核心数据保护声明】
 * 未经用户明确允许，禁止修改此文件中的任何常量配置、资产列表或个股原始财务数据。
 * 此文件包含系统的基础运行参数：折现率、目标资产配比以及个股近5年的核心财务指标。
 * ====================================================================
 */

import { StockConfig, Property } from './types';

export const ZHE_XIAN = 0.04;
export const ALL_DEBT = 0;
export const MAX_DEBT = 0;
export const MI_RATIO = 0.0831372657;
export const MA_RATIO = 0.1520532659;

// 初始资金常量
export const MI_INITIAL = 337964;
export const MA_INITIAL = 400000;
// 妈妈今年初始资产 (用于收益率计算基准)
export const MA_YEAR_START_ASSET = 546776;

export const TAG_RATIO_MAP: Record<string, number> = {
  '黄金': 10,
  '石油': 5,
  '债券': 10,
  '有色': 5,
  '中港': 50,
  '美股': 10,
  '现金': 10,  
};

export const RAW_PROPERTIES: Property[] = [
  { code: 'HK00700', tag: '中港', num: 900 + 1200 + 900, name: '腾讯', exchange: 'hk' },
  { tag: '现金', num: 57172 + 504510 - 12000, name: '人民币' },
  { code: 'USQQQM', tag: '美股', num: 146, exchange: 'us' },
  { tag: '现金', num: 551, name: '港币', exchange: 'hk' },
  { tag: '现金', num:  70 + 89 * 6, name: '美元', exchange: 'us' },
  { code: 'SH511520', tag: '债券', name: '中债', num: 0, danbao: true },
  { code: 'SH600900', tag: '债券', name: '长电', num: 12000, danbao: true },
  { code: 'SH600938', tag: '石油', num: 5600, danbao: true },
  { code: 'SH518880', tag: '黄金', num: 32700 + 1900, name: '黄金etf' },
  { code: 'SH600519', tag: '中港', num: 100, name: '茅台', danbao: true },
  { code: 'SZ000568', tag: '中港', num: 8100, name: '老窖', danbao: true },
  { tag: '黄金', num: 145, name: '国外黄金', code: 'USIAU', exchange: 'us' },
  { tag: '有色', num: 5400 + 200, code: 'SH601899', danbao: true },
  { tag: '中港', code: 'HK09992', num: 0, name: '泡泡玛特', exchange: 'hk' },
];

// eps 统一到26年q1
export const RAW_STOCKS: Record<string, StockConfig> = {
  腾讯: {
    // 数据都更新至26年q1
    code: 'HK00700',
    // 年报-3.31
    目标价格: 725,
    动态收益: 7.58 + 7.61 + 8.15 + 8.54, // 要用non-ifrs口径(投资圈估值默认用这个）
    增速: 10,
    增速pe: 12 + 10,
    // 分红率和回购率也得基于 Non-IFRS 口径，这样才一致
    // 14.96, 16.01, 18.79, 17.05, 17.12
    分红率: (14.96 + 16.01 + 18.79 + 17.05 + 17.12) / 5,
    // 1.94, 27.05, 29.01, 46.57, 28.53
    回购率: 28.53,
    股权折价: 0.8,
  },
  茅台: {
    // 全部数据更新至26年一季报
    code: 'SH600519',
    目标价格: 1678,
    动态收益: 14.8 + 15.35 + 14.13 + 21.76,
    增速: 6,
    增速pe: 15 + 6,
    // 51.9,95.78,84.01,78.9
    分红率: 78.9,
    // 0,0,6.96,7.29
    回购率: 7.29,
    股权折价: 1,
  },
  港交: {
    // 全部数据都更新至25年年报
    code: 'HK00388',
    目标价格: 489,
    动态收益: 3.5 + 3.88 + 3.43 + 3.612,
    增速: 8,
    增速pe: 12 + 8,
    // 一直都是90
    分红率: 90,
    回购率: 0,
    股权折价: 0.8,
  },
  沪深: {
    code: 'SH510300',
    动态收益: 4.871 / 14.6,
    增速: 5,
    // 39.38, 40.16, 41.99, 39.63, 42.48
    分红率: (39.38 + 40.16 + 41.99 + 39.63 + 42.48) / 5,
    // 0.55,1.45,2.5,2,3.25
    回购率: (0.55 + 1.45 + 2.5 + 2 + 3.25) / 5,
    股权折价: 1,
  },
  泡泡: {
    // 数据更新至26年一季报
    code: 'HK09992',
    目标价格: 222.4,
    动态收益: 2.852 + 4.291 + 2.748 + 2.918,
    增速: 4,
    增速pe: 12 + 4,
    // 25.07, 25.33, 35.03, 35.01, 25.02
    分红率: (25.07 + 25.33 + 35.03 + 35.01 + 25.02) / 5,
    // 38.13, 100, 31.55, 2.09, 0
    回购率: 31.55,
    股权折价: 0.8,
  },
  汾酒: {
    // 全部数据更新至26年q1
    code: 'SH600809',
    目标价格: 200.8,
    动态收益: 1.52 + 2.38 + 0.69 + 4.41,
    增速: 2,
    增速pe: 15 + 2,
    // 41.33,50.03,51.07,60.39,65.35
    分红率: 65.35,
    回购率: 0,
    股权折价: 1,
  },
  顺丰: {
    // 全部数据更新至26年一季报
    code: 'SZ002352',
    动态收益: 0.71 + 0.51 + 0.55 + 0.51,
    目标价格: 53,
    增速: 6,
    增速pe: 15 + 6,
    // 18.86, 19.63, 35, 40.34, 40
    分红率: 40,
    // 0,0,0,8.44,13.87
    回购率: 13.87,
    股权折价: 1,
  },
  老窖: {
    // 全部数据更新至26年一季报
    code: 'SZ000568',
    动态收益: 2.08 + 2.1 + 0.05 + 2.52,
    目标价格: 120.8,
    增速: 0,
    增速pe: 15 + 0,
    // 60.01,60,60,65,78.5
    分红率: 78.5,
    回购率: 0,
    股权折价: 1,
  }
};