/**
 * ====================================================================
 * 【核心数据保护声明】
 * 未经用户明确允许，禁止修改此文件中的任何常量配置、资产列表或个股原始财务数据。
 * 此文件包含系统的基础运行参数：折现率、目标资产配比以及个股近5年的核心财务指标。
 * ====================================================================
 */

import { StockConfig, Property } from './types';

export const ZHE_XIAN = 0.03;
export const ALL_DEBT = 268429;
export const MI_RATIO = 0.088190268;
export const MA_RATIO = 0.193524777;

// 初始资金常量
export const MI_INITIAL = 242000;
export const MA_INITIAL = 400000;
// 妈妈今年初始资产 (用于收益率计算基准)
export const MA_YEAR_START_ASSET = 546776;

export const TAG_RATIO_MAP: Record<string, number> = {
  '黄金': 10,
  '石油': 5,
  '中债': 10,
  '美债': 0,
  '有色': 5,
  '中港': 60,
  '美股': 10,
  '现金': 0,
  '比特': 0
};

export const RAW_PROPERTIES: Property[] = [
  { code: 'HK00700', tag: '中港', num: 0, name: '腾讯', exchange: 'hk' },
  { tag: '中港', num: 0, name: '期权预买' },
  { tag: '现金', num: 30 + 4650 + 6760, name: '人民币' },
  { code: 'USSPYM', tag: '美股', num: 263, exchange: 'us' },
  { tag: '现金', num: 22293, name: '港币', exchange: 'hk' },
  { tag: '现金', num: 348 + 3.92 + 100.37 * 175 + 65.41 * 7.6144, name: '美元', exchange: 'us' },
  { code: 'USIBIT', tag: '比特', name: '比特', num: 174, exchange: 'us' },
  { code: 'SH511520', tag: '中债', num: 1300, danbao: true },
  { code: 'USIEF', tag: '美债', num: 219, exchange: 'us' },
  { code: 'HK00883', tag: '石油', num: 7000, exchange: 'hk' },
  { code: 'SH600938', tag: '石油', num: 300, danbao: true },
  { code: 'SH600938', tag: '石油咪', num: 100 },
  { code: 'SZ000568', tag: '中港', num: 0, name: '老窖' },
  { code: 'SH518880', tag: '黄金', num: 21600, name: '黄金etf', danbao: true },
  { code: 'SH600809', tag: '中港', num: 100, name: '汾酒', danbao: true },
  { code: 'SH600519', tag: '中港', num: 600, name: '茅台', danbao: true },
  { code: 'SH600519', tag: '中港', num: 200, name: '茅台融' },
  { code: 'HK00388', tag: '中港', num: 0, name: '港交', exchange: 'hk' },
  { code: 'SH600660', tag: '中港', num: 0, name: '福耀', danbao: true },
  { code: 'SH600900', tag: '中港', num: 0, name: '长电', danbao: true },
  { code: 'SZ002027', tag: '中港', num: 0, name: '分众' },
  { tag: '黄金', num: 145, name: '国外黄金', code: 'USIAU', exchange: 'us' },
  { tag: '有色', num: 4700, code: 'SH601899', danbao: true },
  { tag: '中港', num: 0, name: 'a50', code: 'SH510050' },
  { tag: '中港', code: 'SZ002352', num: 0, name: '顺丰' },
  { tag: '中港', code: 'HK09992', num: 4400, name: '泡泡玛特', exchange: 'hk' }
];

export const RAW_STOCKS: Record<string, StockConfig> = {
  腾讯: {
    code: 'HK00700',
    折价: 0.9,
    现金: [1941, 1752, 1461, 2220, 2585],
    roic表: [20, 21.8, 17.5, 10.5, 15.9],
    利润表: [1598, 2248, 1882, 1152, 1941],
    历史估值: 30.69,
    动态收益: 26.68,
    增速: [14.3, 14.5, 12.7],
    分红率: 17.72,
    回购率: 35.4,
    股权折价: 0.79,
    额外价值: 0,
    周期: 0.75
  },
  茅台: {
    code: 'SH600519',
    折价: 0.9,
    现金: [517, 640, 367, 666, 925],
    roic表: [29.5, 27.4, 29.4, 33.5, 35.2],
    利润表: [467, 525, 627, 747, 862],
    历史估值: 32.31,
    动态收益: 72.48,
    增速: [5.27, 4.94, 5.99],
    分红率: 75,
    回购率: 2.58,
    股权折价: 1,
    额外价值: 2,
    周期: 0.75
  },
  港交: {
    code: 'HK00388',
    折价: 0.9,
    现金: [148, 123, 150, 115, 128],
    roic表: [24.7, 25.4, 20.3, 23.5, 24.8],
    利润表: [115, 125, 101, 119, 131],
    历史估值: 36.51,
    动态收益: 13.63,
    增速: [32.4, 10.1, 7.75],
    分红率: 89.9,
    回购率: 0,
    股权折价: 0.79,
    额外价值: 0,
    周期: 0.5
  },
  福耀: {
    code: 'SH600660',
    折价: 0.7,
    现金: [52.8, 56.8, 58.9, 76.2, 85.6],
    roic表: [8.19, 9.4, 12, 12.2, 14.3],
    利润表: [26, 31.5, 47.6, 56.3, 75],
    历史估值: 19.61,
    动态收益: 3.7,
    增速: [28.7, 14.6, 15.5],
    分红率: 58.21,
    回购率: 0,
    股权折价: 1,
    额外价值: 2,
    周期: 0.75
  },
  长电: {
    code: 'SH600900',
    折价: 0.7,
    现金: [410, 357, 435, 647, 596],
    roic表: [11.4, 10.4, 8.26, 9.23, 8.08],
    利润表: [263, 263, 237, 272, 325],
    历史估值: 18.43,
    动态收益: 1.39,
    增速: [4.51, 4.12, 4.1],
    分红率: 75.75,
    回购率: 0,
    股权折价: 1,
    额外价值: 2,
    周期: 0.75
  },
  分众: {
    code: 'SZ002027',
    折价: 0.7,
    现金: [52.2, 95.9, 67, 76.8, 66.4],
    roic表: [24.2, 30.8, 13.2, 22.9, 24.3],
    利润表: [40, 60.6, 27.9, 48.3, 51.5],
    历史估值: 22.71,
    动态收益: 0.39,
    增速: [9.53, 10.7, 8.57],
    分红率: 86.79,
    回购率: 0,
    股权折价: 1,
    额外价值: 3,
    周期: 0.75
  },
  汾酒: {
    code: 'SH600809',
    折价: 0.7,
    现金: [20.1, 76.5, 103, 72.3, 122],
    roic表: [34.6, 41.7, 43.5, 41.1, 37.7],
    利润表: [30.8, 53.1, 81, 104, 122],
    历史估值: 38.82,
    动态收益: 9.98,
    增速: [-0.52, 6.04, 9.13],
    分红率: 54.5,
    回购率: 0,
    股权折价: 1,
    额外价值: 2,
    周期: 0.75
  },
  老窖: {
    code: 'SZ000568',
    折价: 0.7,
    现金: [49.2, 77, 82.6, 106, 192],
    roic表: [23.7, 26.1, 28, 27.8, 23.8],
    利润表: [60.1, 79.6, 104, 132, 135],
    历史估值: 29.44,
    动态收益: 8.05,
    增速: [-12, 3.18, 8.63],
    分红率: 70,
    回购率: 0,
    股权折价: 1,
    额外价值: 3,
    周期: 0.75
  },
  顺丰: {
    code: 'SZ002352',
    折价: 0.7,
    现金: [113, 154, 327, 266, 322],
    roic表: [10.2, 3.95, 5.04, 5.51, 7.02],
    利润表: [73.3, 42.7, 61.7, 82.3, 102],
    历史估值: 36.13,
    动态收益: 2.17,
    增速: [7.58, 16.2, 14],
    分红率: 35,
    回购率: 14.4,
    股权折价: 1,
    额外价值: 3,
    周期: 0.75
  },
  沪深: {
    code: 'SH510300',
    折价: 0.9,
    roic表: [14.6, 15.1, 15.1, 12.7, 11.2],
    历史估值: 12.4,
    动态收益: ((4.919 / 14.6) * 4 * (1 + 0.0687)) / (3 * (1 + 0.0687) + 1),
    增速: [5.17, 5.17, 5.17],
    分红率: 36.9,
    回购率: 2.3 / 2,
    股权折价: 1,
    额外价值: 2,
    周期: 0.75
  },
  泡泡: {
    code: 'HK09992',
    折价: 0.7,
    现金: [7.03, 7.79, 8.91, 19.9, 49.5],
    roic表: [15.6, 13.2, 6.9, 14.7, 33.8],
    利润表: [5.24, 8.54, 4.76, 10.8, 31.3],
    历史估值: 48.52,
    动态收益: 10.46,
    增速: [305, 36.1, 25.4],
    分红率: 34.45,
    回购率: 33.7 / 2,
    股权折价: 0.79,
    额外价值: 0,
    周期: 0.5
  },
  SPYM: {
    code: 'USSPYM',
    onlyPrice: true,
    折价: 1
  }
};