/**
 * ====================================================================
 * 【核心数据保护声明】
 * 未经用户明确允许，禁止修改此文件中的任何常量配置、资产列表或个股原始财务数据。
 * 此文件包含系统的基础运行参数：折现率、目标资产配比以及个股近5年的核心财务指标。
 * ====================================================================
 */

import { StockConfig, Property } from './types';

export const ZHE_XIAN = 0.04;
export const ALL_DEBT = 241140
export const MI_RATIO = 0.18849268;
export const MA_RATIO = 0.16288967;

// 初始资金常量
export const MI_INITIAL = 677964;
export const MA_INITIAL = 400000;
// 妈妈今年初始资产 (用于收益率计算基准)
export const MA_YEAR_START_ASSET = 546776;

export const TAG_RATIO_MAP: Record<string, number> = {
  '黄金': 10,
  '石油': 5,
  '债券': 10,
  '有色': 5,
  '中港': 50,
  '美股': 10,
  '现金': 10
};

export const RAW_PROPERTIES: Property[] = [
  { code: 'HK00700', tag: '中港', num: 0, name: '腾讯', exchange: 'hk' },
  { tag: '现金', num: 28401, name: '人民币' },
  { code: 'USSPYM', tag: '美股', num: 484, exchange: 'us' },
  { tag: '现金', num: 3473 + 10227, name: '港币', exchange: 'hk' },
  { tag: '现金', num: 3.14 + 36.07 + 69.23 * 7.6144, name: '美元', exchange: 'us' },
  { code: 'SH511520', tag: '债券', name: '中债', num: 0, danbao: true },
  { code: 'SH600900', tag: '债券', name: '长电', num: 13600, danbao: true },
  { code: 'SH600938', tag: '石油', num: 4100, danbao: true },
  { code: 'SH518880', tag: '黄金', num: 27200, name: '黄金etf', danbao: true },
  { code: 'SH600809', tag: '中港', num: 0, name: '汾酒', danbao: true },
  { code: 'SH600519', tag: '中港', num: 700, name: '茅台', danbao: true },
  { tag: '黄金', num: 145, name: '国外黄金', code: 'USIAU', exchange: 'us' },
  { tag: '有色', num: 5400, code: 'SH601899', danbao: true },
  // 2000在咪咪账户
  { tag: '中港', code: 'HK09992', num: 2800 + 3400 + 2000, name: '泡泡玛特', exchange: 'hk' },

  // 咪咪账户里
  { code: 'SH511520', tag: '债券', name: '中债', num: 0 },
  { code: 'SH600900', tag: '债券', name: '长电', num: 1800 },
  { code: 'SH600938', tag: '石油', num: 500 },
  { code: 'SH600036', tag: '中港', num: 0, name: '招行' },
  { tag: '有色', num: 800, code: 'SH601899' },
  { tag: '现金', num: 133398, name: '人民币' },
  { code: 'SH518880', tag: '黄金', num: 5400, name: '黄金etf' },
];

// eps 统一到26年q1
export const RAW_STOCKS: Record<string, StockConfig> = {
  腾讯: {
    // 全部数据都更新至25年年报
    code: 'HK00700',
    // 年报-3.31
    目标价格: 738.5,
    动态收益: 7.58 + 7.61 + 8.15 + 8.5, // 要用non-ifrs口径(投资圈估值默认用这个）
    增速: 10,
    // 分红率和回购率也得基于 Non-IFRS 口径，这样才一致
    // 14.96, 16.01, 18.79, 17.05, 17.12
    分红率: (14.96 + 16.01 + 18.79 + 17.05 + 17.12) / 5,
    // 1.94, 27.05, 29.01, 46.57, 28.53
    回购率: 28.53,
    股权折价: 0.8,
  },
  茅台: {
    // 全部数据更新至25年年报
    code: 'SH600519',
    目标价格: 1752,
    动态收益: 14.8 + 15.35 + 14.13 + 21.76,
    增速: 6,
    // 51.9,95.78,84.01,78.9
    分红率: 78.9,
    // 0,0,6.96,7.29
    回购率: 7.29,
    股权折价: 1,
  },
  港交: {
    // 全部数据都更新至25年年报
    code: 'HK00388',
    目标价格: 521.53,
    动态收益: 3.5 + 3.88 + 3.43 + 3.612,
    增速: 8,
    // 一直都是90
    分红率: 90,
    回购率: 0,
    股权折价: 0.8,
  },
  沪深: {
    code: 'SH510300',
    动态收益: 4.746 / 14.4,
    // 沪深300没有目标价，按10年估值中枢来算，注意要还原计算那边的85折
    目标价格: (4.746 / 14.4) * 12.6 / 0.85,
    增速: 5,
    // 39.38, 40.16, 41.99, 39.63, 42.48
    分红率: (39.38 + 40.16 + 41.99 + 39.63 + 42.48) / 5,
    // 0.55,1.45,2.5,2,3.25
    回购率: (0.55 + 1.45 + 2.5 + 2 + 3.25) / 5,
    股权折价: 1,
  },
  泡泡: {
    // 全部数据都更新至25年年报
    code: 'HK09992',
    目标价格: 248,
    动态收益: 2.21 + 4 + 2.77 + 3.71,
    增速: 2,
    // 25.07, 25.33, 35.03, 35.01, 25.02
    分红率: (25.07 + 25.33 + 35.03 + 35.01 + 25.02) / 5,
    // 38.13, 100, 31.55, 2.09, 0
    回购率: 31.55,
    股权折价: 0.8,
  },
  汾酒: {
    // 数据更新至25年年报，目标价待更新
    code: 'SH600809',
    目标价格: 229.34,
    动态收益: 1.52 + 2.38 + 0.69 + 4.2,
    增速: 2,
    // 41.33,50.03,51.07,60.39,65.35
    分红率: 65.35,
    回购率: 0,
    股权折价: 1,
  },
  顺丰: {
    // 全部数据都更新至25年年报
    code: 'SZ002352',
    动态收益: 0.71 + 0.51 + 0.55 + 0.5,
    目标价格: 49.8,
    增速: 6,
    // 18.86, 19.63, 35, 40.34, 40
    分红率: 40,
    // 0,0,0,8.44,13.87
    回购率: 13.87,
    股权折价: 1,
  },
  老窖: {
    code: 'SZ000568',
    动态收益: 2.08 + 2.1 + 0.966 + 2.78,
    目标价格: 163.42,
    增速: -2,
    // 50.02,60.01,60,60,65
    分红率: 65,
    回购率: 0,
    股权折价: 1,
  }
};