/**
 * ====================================================================
 * 【核心数据保护声明】
 * 未经用户明确允许，禁止修改此文件中的任何常量配置、资产列表或个股原始财务数据。
 * 此文件包含系统的基础运行参数：折现率、目标资产配比以及个股近5年的核心财务指标。
 * ====================================================================
 */

import { StockConfig, Property } from './types';

export const ZHE_XIAN = 0.04;
export const ALL_DEBT = 445047
export const MI_RATIO = 0.195873379;
export const MA_RATIO = 0.169267677;

// 初始资金常量
export const MI_INITIAL = 677964;
export const MA_INITIAL = 400000;
// 妈妈今年初始资产 (用于收益率计算基准)
export const MA_YEAR_START_ASSET = 546776;

export const TAG_RATIO_MAP: Record<string, number> = {
  '黄金': 10,
  '石油': 5,
  '债券': 10,
  '有色': 5,
  '中港': 60,
  '美股': 10,
  '现金': 0
};

export const RAW_PROPERTIES: Property[] = [
  { code: 'HK00700', tag: '中港', num: 0, name: '腾讯', exchange: 'hk' },
  { tag: '现金', num: 3774 + 140592 + 10253, name: '人民币' },
  { code: 'USSPYM', tag: '美股', num: 484, exchange: 'us' },
  { tag: '现金', num: 3363 + 10188, name: '港币', exchange: 'hk' },
  { tag: '现金', num: 3.14 + 36.07 + 69.23 * 7.6144, name: '美元', exchange: 'us' },
  { code: 'SH511520', tag: '债券', name: '中债', num: 3100, danbao: true },
  { code: 'SH600938', tag: '石油', num: 4100, danbao: true },
  { code: 'SH518880', tag: '黄金', num: 27200, name: '黄金etf', danbao: true },
  { code: 'SH600809', tag: '中港', num: 0, name: '汾酒', danbao: true },
  { code: 'SH600519', tag: '中港', num: 700, name: '茅台', danbao: true },
  { tag: '黄金', num: 145, name: '国外黄金', code: 'USIAU', exchange: 'us' },
  { tag: '有色', num: 5400, code: 'SH601899', danbao: true },
  // 2000在咪咪账户
  { tag: '中港', code: 'HK09992', num: 2800 + 3400 + 2000, name: '泡泡玛特', exchange: 'hk' },

  // 咪咪账户里
  { code: 'SH511520', tag: '债券', name: '中债', num: 400 },
  { code: 'SH600938', tag: '石油', num: 500 },
  { code: 'SH600036', tag: '中港', num: 0, name: '招行' },
  { tag: '有色', num: 800, code: 'SH601899' },
  { tag: '现金', num: 84692, name: '人民币' },
  { code: 'SH518880', tag: '黄金', num: 5400, name: '黄金etf' },
];

// 沪深300增速，用来作为增速预估的基准
export const HUSHEN_G = 5.17

export const RAW_STOCKS: Record<string, StockConfig> = {
  腾讯: {
    // 全部数据都更新至25年年报
    code: 'HK00700',
    // 年报-3.31
    目标价格: 738.5,
    动态收益: 31.02, // 要用non-ifrs口径(投资圈估值默认用这个）
    增速: 2 * HUSHEN_G,
    // 分红率和回购率也得基于 Non-IFRS 口径，这样才一致
    // 14.96, 16.01, 18.79, 17.05, 17.12
    分红率: (14.96 + 16.01 + 18.79 + 17.05 + 17.12) / 5,
    // 1.94, 27.05, 29.01, 46.57, 28.53
    回购率: 28.53,
    股权折价: 0.8,
    额外价值: 0
  },
  茅台: {
    code: 'SH600519',
    目标价格: 1875.01,
    动态收益: 21.38 + 14.8 + 15.35 + 18.607,
    增速: 2 * HUSHEN_G,
    // 51.91,51.9,95.78,84.01,75
    分红率: 75,
    // 0,0,0,0,6.96
    回购率: 6.96 / 5,
    股权折价: 1,
    额外价值: 2
  },
  港交: {
    // 全部数据都更新至25年年报
    code: 'HK00388',
    目标价格: 521.53,
    动态收益: 14.01,
    增速: 1.5 * HUSHEN_G,
    // 一直都是90
    分红率: 90,
    回购率: 0,
    股权折价: 0.8,
    额外价值: 0
  },
  沪深: {
    code: 'SH510300',
    动态收益: ((4.919 / 14.6) * 4 * (1 + 0.0687)) / (3 * (1 + 0.0687) + 1),
    增速: HUSHEN_G,
    // 39.38, 40.16, 41.99, 39.63, 42.48
    分红率: (39.38 + 40.16 + 41.99 + 39.63 + 42.48) / 5,
    // 0.55,1.45,2.5,2,3.25
    回购率: (0.55 + 1.45 + 2.5 + 2 + 3.25) / 5,
    股权折价: 1,
    额外价值: 2
  },
  长电: {
    code: 'SH600900',
    目标价格: 33.86,
    动态收益: 1.3964,
    增速: 0.5 * HUSHEN_G,
    // 60.51, 70.57, 94.29, 73.66, 71
    分红率: 71,
    回购率: 0,
    股权折价: 1,
    额外价值: 2
  },
  招行: {
    // 全部数据都更新至25年年报
    code: 'SH600036',
    目标价格: 53.07,
    动态收益: 5.7,
    增速: 0.5 * HUSHEN_G,
    // 33,33,35.01,35.32,35.32
    分红率: 35.32,
    回购率: 0,
    股权折价: 1,
    额外价值: 2
  },
  泡泡: {
    // 全部数据都更新至25年年报
    code: 'HK09992',
    // 年报发布至3.31
    目标价格: 248,
    动态收益: 10.61,
    增速: HUSHEN_G,
    // 25.07, 25.33, 35.03, 35.01, 25.02
    分红率: (25.07 + 25.33 + 35.03 + 35.01 + 25.02) / 5,
    // 38.13, 100, 31.55, 2.09, 0
    回购率: 31.55,
    股权折价: 0.8,
    额外价值: 0
  },
  汾酒: {
    code: 'SH600809',
    目标价格: 229.34,
    动态收益: 5.45 + 1.52 + 2.38 + 0.515,
    增速: 0.5 * HUSHEN_G,
    // 5.66,41.33,50.03,51.07,60.39
    分红率: 60.39,
    回购率: 0,
    股权折价: 1,
    额外价值: 2
  },
  顺丰: {
    code: 'SZ002352',
    动态收益: 0.45 + 0.71 + 0.51 + 0.525,
    目标价格: 52.53,
    增速: 1.5 * HUSHEN_G,
    // 20.48, 18.86, 19.63, 35, 40.34
    分红率: (20.48 + 18.86 + 19.63 + 35 + 40.34) / 5,
    // 0.72,0,0,0,0,17.3
    回购率: (0.72 + 17.3) / 5,
    股权折价: 1,
    额外价值: 3
  },
  老窖: {
    code: 'SZ000568',
    动态收益: 3.13 + 2.08 + 2.1 + 0.966,
    目标价格: 163.42,
    增速: 0,
    // 50.02,60.01,60,60,65
    分红率: 65,
    回购率: 0,
    股权折价: 1,
    额外价值: 3
  }
};