/**
 * ====================================================================
 * 【核心数据保护声明】
 * 未经用户明确允许，禁止修改此文件中的任何常量配置、资产列表或个股原始财务数据。
 * 此文件包含系统的基础运行参数：折现率、目标资产配比以及个股近5年的核心财务指标。
 * ====================================================================
 */

import { StockConfig, Property } from './types';

export const ZHE_XIAN = 0.04;
export const ALL_DEBT = 214265
export const MI_RATIO = 0.198521151;
export const MA_RATIO = 0.168710426;

// 初始资金常量
export const MI_INITIAL = 689964;
export const MA_INITIAL = 400000;
// 妈妈今年初始资产 (用于收益率计算基准)
export const MA_YEAR_START_ASSET = 546776;

export const TAG_RATIO_MAP: Record<string, number> = {
  '黄金': 10,
  '石油': 5,
  '债券': 10,
  '有色': 5,
  '中港': 50,
  '美股': 10,
  '现金': 10
};

export const RAW_PROPERTIES: Property[] = [
  { code: 'HK00700', tag: '中港', num: 400, name: '腾讯', exchange: 'hk' },
  { tag: '现金', num: 0, name: '人民币' },
  { code: 'USSPYM', tag: '美股', num: 484, exchange: 'us' },
  { tag: '现金', num: 3363 + 57125 - 50847, name: '港币', exchange: 'hk' },
  { tag: '现金', num: 3823 + 17.27 + 120.47 + 74.97 * 7.6144, name: '美元', exchange: 'us' },
  { code: 'SH511520', tag: '债券', name: '中债', num: 3100, danbao: true },
  { code: 'HK00883', tag: '石油', num: 7000, exchange: 'hk' },
  { code: 'SH600938', tag: '石油', num: 300, danbao: true },
  { code: 'SH518880', tag: '黄金', num: 21600, name: '黄金etf', danbao: true },
  { code: 'SH600809', tag: '中港', num: 0, name: '汾酒', danbao: true },
  { code: 'SH600519', tag: '中港', num: 900, name: '茅台', danbao: true },
  { tag: '黄金', num: 145, name: '国外黄金', code: 'USIAU', exchange: 'us' },
  { tag: '有色', num: 4700, code: 'SH601899', danbao: true },
  { tag: '中港', code: 'HK09992', num: 2400, name: '泡泡玛特', exchange: 'hk' },

  // 咪咪账户里
  { code: 'SH511520', tag: '债券', name: '中债', num: 400 },
  { code: 'SH600938', tag: '石油', num: 500 },
  { code: 'SH600036', tag: '中港', num: 6600, name: '招行' },
  { tag: '有色', num: 700, code: 'SH601899' },
  { tag: '现金', num: 127542, name: '人民币' },
  { code: 'SH518880', tag: '黄金', num: 4600, name: '黄金etf' },
];

// 沪深300增速，用来作为增速预估的基准
export const HUSHEN_G = 5.17

export const RAW_STOCKS: Record<string, StockConfig> = {
  腾讯: {
    code: 'HK00700',
    目标价格: 740,
    动态收益: 29.48, // 要用non-ifrs口径(投资圈估值默认用这个）
    g1: 15.1,
    g2: 11.5,
    远期增速: 2 * HUSHEN_G,
    // 分红率和回购率也得基于 Non-IFRS 口径，这样才一致
    分红率: 13.62,
    回购率: 46.6,
    股权折价: 0.8,
    额外价值: 0
  },
  茅台: {
    code: 'SH600519',
    目标价格: 1890,
    动态收益: 72.05,
    g1: 5.02,
    g2: 5.41,
    远期增速: 2 * HUSHEN_G,
    分红率: 75,
    回购率: 1.86,
    股权折价: 1,
    额外价值: 2
  },
  港交: {
    code: 'HK00388',
    目标价格: 514,
    动态收益: 14.05,
    g1: 5.78,
    g2: 4.79,
    远期增速: 1.5 * HUSHEN_G,
    分红率: 90,
    回购率: 0,
    股权折价: 0.8,
    额外价值: 0
  },
  沪深: {
    code: 'SH510300',
    历史估值: 12.4,
    动态收益: ((4.919 / 14.6) * 4 * (1 + 0.0687)) / (3 * (1 + 0.0687) + 1),
    g1: HUSHEN_G,
    g2: HUSHEN_G,
    远期增速: HUSHEN_G,
    分红率: 39.99,
    回购率: 2.78,
    股权折价: 1,
    额外价值: 2
  },
  长电: {
    code: 'SH600900',
    目标价格: 34.32,
    动态收益: 1.3964,
    g1: 3.59,
    g2: 3.21,
    远期增速: 0.5 * HUSHEN_G,
    分红率: 71.8,
    回购率: 0,
    股权折价: 1,
    额外价值: 2
  },
  招行: {
    code: 'SH600036',
    目标价格: 53.8,
    动态收益: 5.7,
    g1: 3.79,
    g2: 4.6,
    远期增速: 0.5 * HUSHEN_G,
    分红率: 35.3,
    回购率: 0,
    股权折价: 1,
    额外价值: 2
  },
  泡泡: {
    code: 'HK09992',
    目标价格: 340,
    动态收益: 10.89,
    g1: 31.2,
    g2: 22.8,
    远期增速: 0.5 * HUSHEN_G,
    分红率: 35,
    回购率: 16.4,
    股权折价: 0.8,
    额外价值: 0
  },
  汾酒: {
    code: 'SH600809',
    目标价格: 220.79,
    动态收益: 10,
    g1: 6.9,
    g2: 9.3,
    远期增速: 0.5 * HUSHEN_G,
    分红率: 60.39,
    回购率: 0,
    股权折价: 1,
    额外价值: 2
  },
  顺丰: {
    code: 'SZ002352',
    动态收益: 2.18,
    目标价格: 53.55,
    g1: 14.51,
    g2: 13.28,
    远期增速: 0.5 * HUSHEN_G,
    分红率: 35,
    回购率: 9.88,
    股权折价: 1,
    额外价值: 3
  },
  阿胶: {
    code: 'SZ000423',
    动态收益: 2.75,
    目标价格: 73.61,
    g1: 14.92,
    g2: 14.58,
    远期增速: 0,
    分红率: 90, // 任何企业分红+回购上限90，不能按100算（10年百分百分红不现实）
    回购率: 0,
    股权折价: 1,
    额外价值: 3
  },
  老窖: {
    code: 'SZ000568',
    动态收益: 8.73,
    目标价格: 147,
    g1: 6.56,
    g2: 8.78,
    远期增速: 0,
    分红率: 72.5,
    回购率: 0,
    股权折价: 1,
    额外价值: 3
  },
  // 福耀: {
  //   code: 'SH600660',
  //   折价: 0.7,
  //   现金: [52.8, 56.8, 58.9, 76.2, 85.6],
  //   roic表: [8.19, 9.4, 12, 12.2, 14.3],
  //   利润表: [26, 31.5, 47.6, 56.3, 75],
  //   动态收益: 3.72,
  //   分红率: 58.21,
  //   回购率: 0,
  //   股权折价: 1,
  //   额外价值: 2,
  //   周期: 0.75
  // },
  // 分众: {
  //   code: 'SZ002027',
  //   折价: 0.7,
  //   现金: [52.2, 95.9, 67, 76.8, 66.4],
  //   roic表: [24.2, 30.8, 13.2, 22.9, 24.3],
  //   利润表: [40, 60.6, 27.9, 48.3, 51.5],
  //   动态收益: 0.39,
  //   分红率: 86.79,
  //   回购率: 0,
  //   股权折价: 1,
  //   额外价值: 3,
  //   周期: 0.75
  // },
};